LoadTesting/scripts/getBooksForUser_All_500.txt
Running 5m test
  2 threads and 10 connections
  Thread calibration: mean lat.: 5147.458ms, rate sampling interval: 17498ms
  Thread calibration: mean lat.: 4935.588ms, rate sampling interval: 16875ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.24m     1.26m    4.78m    60.24%
    Req/Sec    10.52      2.28    14.00     75.76%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.13m 
 75.000%    3.27m 
 90.000%    4.05m 
 99.000%    4.73m 
 99.900%    4.78m 
 99.990%    4.78m 
 99.999%    4.78m 
100.000%    4.78m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    9609.215     0.000000            1         1.00
   36274.175     0.100000          630         1.11
   61046.783     0.200000         1260         1.25
   82182.143     0.300000         1888         1.43
  105840.639     0.400000         2517         1.67
  127926.271     0.500000         3148         2.00
  139722.751     0.550000         3462         2.22
  151257.087     0.600000         3776         2.50
  166068.223     0.650000         4091         2.86
  179699.711     0.700000         4405         3.33
  196476.927     0.750000         4720         4.00
  204734.463     0.775000         4877         4.44
  212598.783     0.800000         5035         5.00
  217448.447     0.825000         5192         5.71
  226885.631     0.850000         5349         6.67
  233963.519     0.875000         5507         8.00
  239075.327     0.887500         5585         8.89
  242876.415     0.900000         5665        10.00
  248119.295     0.912500         5742        11.43
  254541.823     0.925000         5822        13.33
  260177.919     0.937500         5902        16.00
  262275.071     0.943750         5939        17.78
  264503.295     0.950000         5980        20.00
  266862.591     0.956250         6018        22.86
  270008.319     0.962500         6058        26.67
  273416.191     0.968750         6096        32.00
  275775.487     0.971875         6118        35.56
  276824.063     0.975000         6135        40.00
  278659.071     0.978125         6155        45.71
  280231.935     0.981250         6175        53.33
  281280.511     0.984375         6194        64.00
  282066.943     0.985938         6207        71.11
  282591.231     0.987500         6215        80.00
  283377.663     0.989062         6226        91.43
  283901.951     0.990625         6235       106.67
  284426.239     0.992188         6247       128.00
  284688.383     0.992969         6252       142.22
  284950.527     0.993750         6257       160.00
  285212.671     0.994531         6264       182.86
  285212.671     0.995313         6264       213.33
  285736.959     0.996094         6272       256.00
  285736.959     0.996484         6272       284.44
  285999.103     0.996875         6277       320.00
  285999.103     0.997266         6277       365.71
  286261.247     0.997656         6284       426.67
  286261.247     0.998047         6284       512.00
  286261.247     0.998242         6284       568.89
  286261.247     0.998437         6284       640.00
  286261.247     0.998633         6284       731.43
  286523.391     0.998828         6288       853.33
  286523.391     0.999023         6288      1024.00
  286523.391     0.999121         6288      1137.78
  286523.391     0.999219         6288      1280.00
  286523.391     0.999316         6288      1462.86
  286785.535     0.999414         6291      1706.67
  286785.535     0.999512         6291      2048.00
  286785.535     0.999561         6291      2275.56
  286785.535     0.999609         6291      2560.00
  286785.535     0.999658         6291      2925.71
  286785.535     0.999707         6291      3413.33
  286785.535     0.999756         6291      4096.00
  286785.535     0.999780         6291      4551.11
  286785.535     0.999805         6291      5120.00
  286785.535     0.999829         6291      5851.43
  287047.679     0.999854         6292      6826.67
  287047.679     1.000000         6292          inf
#[Mean    =   134692.134, StdDeviation   =    75471.778]
#[Max     =   286785.536, Total count    =         6292]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6503 requests in 4.99m, 56.01MB read
  Socket errors: connect 0, read 0, write 0, timeout 6
Requests/sec:     21.71
Transfer/sec:    191.45KB