LoadTesting/scripts/getBooksForUser_All_750.txt
Running 5m test
  2 threads and 10 connections
  Thread calibration: mean lat.: 5423.311ms, rate sampling interval: 17039ms
  Thread calibration: mean lat.: 5229.077ms, rate sampling interval: 17268ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.50m     1.32m    4.84m    58.41%
    Req/Sec    11.30      1.17    13.00     93.94%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.50m 
 75.000%    3.64m 
 90.000%    4.28m 
 99.000%    4.80m 
 99.900%    4.83m 
 99.990%    4.84m 
 99.999%    4.84m 
100.000%    4.84m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    9707.519     0.000000            1         1.00
   40665.087     0.100000          680         1.11
   69271.551     0.200000         1360         1.25
   96862.207     0.300000         2041         1.43
  122945.535     0.400000         2721         1.67
  149946.367     0.500000         3403         2.00
  164757.503     0.550000         3742         2.22
  178257.919     0.600000         4083         2.50
  192413.695     0.650000         4420         2.86
  206045.183     0.700000         4763         3.33
  218628.095     0.750000         5100         4.00
  225837.055     0.775000         5271         4.44
  231735.295     0.800000         5442         5.00
  239075.327     0.825000         5613         5.71
  245104.639     0.850000         5781         6.67
  251396.095     0.875000         5953         8.00
  253886.463     0.887500         6035         8.89
  256901.119     0.900000         6121        10.00
  259915.775     0.912500         6208        11.43
  264241.151     0.925000         6293        13.33
  268959.743     0.937500         6375        16.00
  271056.895     0.943750         6423        17.78
  272629.759     0.950000         6467        20.00
  273940.479     0.956250         6502        22.86
  276561.919     0.962500         6549        26.67
  278921.215     0.968750         6587        32.00
  281542.655     0.971875         6612        35.56
  283377.663     0.975000         6636        40.00
  284426.239     0.978125         6654        45.71
  285474.815     0.981250         6678        53.33
  286261.247     0.984375         6695        64.00
  286785.535     0.985938         6708        71.11
  287309.823     0.987500         6718        80.00
  287571.967     0.989062         6728        91.43
  288096.255     0.990625         6741       106.67
  288358.399     0.992188         6750       128.00
  288620.543     0.992969         6757       142.22
  288620.543     0.993750         6757       160.00
  288882.687     0.994531         6765       182.86
  289144.831     0.995313         6769       213.33
  289406.975     0.996094         6777       256.00
  289406.975     0.996484         6777       284.44
  289669.119     0.996875         6785       320.00
  289669.119     0.997266         6785       365.71
  289669.119     0.997656         6785       426.67
  289931.263     0.998047         6792       512.00
  289931.263     0.998242         6792       568.89
  289931.263     0.998437         6792       640.00
  289931.263     0.998633         6792       731.43
  289931.263     0.998828         6792       853.33
  290193.407     0.999023         6797      1024.00
  290193.407     0.999121         6797      1137.78
  290193.407     0.999219         6797      1280.00
  290193.407     0.999316         6797      1462.86
  290193.407     0.999414         6797      1706.67
  290193.407     0.999512         6797      2048.00
  290193.407     0.999561         6797      2275.56
  290193.407     0.999609         6797      2560.00
  290193.407     0.999658         6797      2925.71
  290455.551     0.999707         6799      3413.33
  290455.551     1.000000         6799          inf
#[Mean    =   150148.884, StdDeviation   =    79141.324]
#[Max     =   290193.408, Total count    =         6799]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  7069 requests in 4.99m, 60.69MB read
  Socket errors: connect 0, read 0, write 0, timeout 2
Requests/sec:     23.61
Transfer/sec:    207.56KB